ИС_СПОРТ_2022/src/DocumentJournals/СоставГрупп/СоставГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>СоставГрупп</name>
  <registeredDocuments>Document.ФормированиеГруппы</registeredDocuments>
  <registeredDocuments>Document.ПереводСпортсменовМеждуГруппами</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>ВидСпорта</name>
  </columns>
  <columns>
    <name>УчебныйГод</name>
  </columns>
  <columns>
    <name>ТренерСборной</name>
  </columns>
  <columns>
    <name>Группа</name>
  </columns>
  <columns>
    <name>ДатаПриказа</name>
  </columns>
  <columns>
    <name>НомерПриказа</name>
  </columns>
</mdclass:DocumentJournal>

ИС_СПОРТ_2022/src/Documents/ФормированиеГруппы/ФормированиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеГруппы</name>
  <registerRecords>InformationRegister.СоставГруппы</registerRecords>
  <registerRecords>InformationRegister.ЛичныйТренерСпортсмена</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТренерСборной</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокЛичныхТренеров</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРаботыСТренером</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРаботыСТренером</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ВключениеСпортсменовВГруппу/ВключениеСпортсменовВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВключениеСпортсменовВГруппу</name>
  <registerRecords>InformationRegister.СоставГруппы</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТренерСборной</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокЛичныхТренеров</name>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ИсключениеСпортсменовИзГруппы/ИсключениеСпортсменовИзГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсключениеСпортсменовИзГруппы</name>
  <registerRecords>InformationRegister.СоставГруппы</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТренерСборной</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ОснованияДляОтчисленияСпортсменов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсключенияИзГруппы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ИсключениеИзСпортивногоУчреждения/ИсключениеИзСпортивногоУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсключениеИзСпортивногоУчреждения</name>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтчисления</name>
    <type>
      <types>EnumRef.ПричиныОтчисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеОтчисления</name>
    <type>
      <types>EnumRef.ОснованиеОтчисления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/DocumentJournals/СоставГрупп/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Спортсмен") Тогда
		ТекущийСпортсмен = Параметры.Спортсмен;
		УстановитьОтборПоСпортсменуНаСервере();
	КонецЕсли;
	
	//// + Адильбеков А.Б. 02.06.20 IN-6762 {
	//// Создадим группу печать
	//ГруппаКнопокПечать 							= ЭтаФорма.Элементы.Добавить("ФормаГруппаПечать", Тип("ГруппаКнопокФормы"),ЭтаФорма.Элементы.ФормаКоманднаяПанель);
	//ГруппаКнопокПечать.Вид 						= ВидГруппыФормы.Подменю;
	//ГруппаКнопокПечать.Заголовок 				= "Печать";
	//ГруппаКнопокПечать.Картинка      			= БиблиотекаКартинок.Печать;
	//ГруппаКнопокПечать.РастягиватьПоГоризонтали = ИСТИНА;
	//
	//// Создадим команду
	//НоваяКомандаФормы				= ЭтаФорма.Команды.Добавить("ПечатьПриказ");
	//НоваяКомандаФормы.Заголовок 	= "Приказ";
	//НоваяКомандаФормы.Действие		= "ПечатьПриказ";
	//
	//// Создадим кнопку и привяжем к ней команду
	//НоваяКнопкаФормы				= ЭтаФорма.Элементы.Вставить("Приказ",Тип("КнопкаФормы"), ЭтаФорма.Элементы.ФормаКоманднаяПанель.ГруппаКнопокПечать);
	//НоваяКнопкаФормы.Вид			= ВидКнопкиФормы.ОбычнаяКнопка;
	//НоваяКнопкаФормы.Картинка       = БиблиотекаКартинок.Печать;
	//НоваяКнопкаФормы.ИмяКоманды		= "ПечатьПриказ";
	//
	//// Создадим команду
	//НоваяКомандаФормы				= ЭтаФорма.Команды.Добавить("ПечатьСлужебнаяЗаписка");
	//НоваяКомандаФормы.Заголовок 	= "Служебная записка";
	//НоваяКомандаФормы.Действие		= "ПечатьСлужебнаяЗаписка";
	//
	//// Создадим кнопку и привяжем к ней команду
	//НоваяКнопкаФормы				= ЭтаФорма.Элементы.Вставить("СлужебнаяЗаписка",Тип("КнопкаФормы"),ЭтаФорма.Элементы.ФормаКоманднаяПанель.ГруппаКнопокПечать);
	//НоваяКнопкаФормы.Вид			= ВидКнопкиФормы.ОбычнаяКнопка;
	//НоваяКнопкаФормы.Картинка       = БиблиотекаКартинок.Печать;
	//НоваяКнопкаФормы.ИмяКоманды		= "ПечатьСлужебнаяЗаписка";
	//
	//// - Адильбеков А.Б. 02.06.20 IN-6762 }
		
КонецПроцедуры

#КонецОбласти

// + Адильбеков А.Б. 02.06.20 IN-6762 {

&НаКлиенте
Процедура ПечатьПриказ(Команда)
	// Массив выделенных строк из списка СоставКоманд.
	ДанныеПечати = Элементы.Список.ВыделенныеСтроки;
	
	МассивФормированиеКоманд 	= Новый Массив; 
	МассивВключениеВКоманду 	= Новый Массив;
	МассивИсключениеИзКоманды 	= Новый Массив; 
	//Цикл по разделению документов
	Для каждого ОбъектПечати Из ДанныеПечати Цикл
	
		Если ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ФормированиеГруппы") Тогда
			МассивФормированиеКоманд.Добавить(ОбъектПечати); 	         
		ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ВключениеСпортсменовВГруппу") Тогда 			
			МассивВключениеВКоманду.Добавить(ОбъектПечати);
		ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ИсключениеСпортсменовИзГруппы") Тогда 			
			МассивИсключениеИзКоманды.Добавить(ОбъектПечати);	
		КонецЕсли; 
	
	КонецЦикла;  
	
	#Если Не ВебКлиент Тогда
		Если МассивФормированиеКоманд.Количество() <> 0 Тогда 
			Печать("Документ.ФормированиеГруппы", "ПФ_DOC_Приказ", МассивФормированиеКоманд, "Формирование группы Word");
		КонецЕсли;
		
		Если МассивВключениеВКоманду.Количество() <> 0 Тогда
			Печать("Документ.ВключениеСпортсменовВГруппу", "ПФ_DOC_ПриказВключение", МассивВключениеВКоманду, "Включение в группу Word");
		КонецЕсли;
		
		Если МассивИсключениеИзКоманды.Количество() <> 0 Тогда
			Печать("Документ.ИсключениеСпортсменовИзГруппы", "ПФ_DOC_ИсключениеИзКоманды", МассивИсключениеИзКоманды, "Отчисление из группы Word");
		КонецЕсли;
	#Иначе
		Если МассивФормированиеКоманд.Количество() <> 0 Тогда	
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ФормированиеГруппы",
			"ПФ_MXL_Приказ",
			МассивФормированиеКоманд,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
		
		Если МассивВключениеВКоманду.Количество() <> 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ВключениеСпортсменовВГруппу",
			"ПФ_MXL_ПриказВключение",
			МассивВключениеВКоманду,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
		
		Если МассивИсключениеИзКоманды.Количество() <> 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ИсключениеСпортсменовИзГруппы",
			"ПФ_MXL_ИсключениеИзКоманды",
			МассивИсключениеИзКоманды,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура Печать(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати, НаименованиеМакета)
	
	// Не работает здесь, пишет Метод Количество() не обнаружен.
	//Если ДанныеПечати.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;   
		
	МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати);
	
	Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, НаименованиеМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, НаименованиеМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		
	Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	
	Для Каждого ОбъектДанных Из ДанныеПечати Цикл
		
		ДанныеОбъектаМассив     = МакетИДанныеОбъекта.Данные[ОбъектДанных][ИмяМакета];
		
		Для Каждого ДанныеОбъекта Из  ДанныеОбъектаМассив Цикл
			
			Попытка
				
				ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
				Если ПечатнаяФорма = Неопределено Тогда
					УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
					Возврат;                                                             
				КонецЕсли;
				
				Попытка
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьШапка"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.ОбластьШапка, Ложь);	
				Исключение
				КонецПопытки; 
										
				Если ИмяМакета = "ПФ_DOC_ИсключениеИзКоманды" Тогда
						Для Каждого СтрокаСпортсмены Из ДанныеОбъекта.ОбластьШапкаТаблицы Цикл
							Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьШапкаТаблицы"]);
							УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаСпортсмены, Ложь);
							Для каждого Строка Из СтрокаСпортсмены.МассивСтрокСпортсмены Цикл
								Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьСтрокаТаблицыСпортсмены"]);
								УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, Строка, Ложь);
							КонецЦикла; 			
						КонецЦикла;	
					Иначе
						Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьШапкаТаблицы"]);
						УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.ОбластьШапкаТаблицы, Ложь);
						Для Каждого СтрокаТаблицыСпортсмены Из ДанныеОбъекта.ОбластьСтрокаТаблицыСпортсмены Цикл
							Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьСтрокаТаблицыСпортсмены"]);
							УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицыСпортсмены, Ложь);
						КонецЦикла;	
					КонецЕсли;	
					
				Попытка
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьПодвал"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.ОбластьПодвал, Ложь);
				Исключение	
				КонецПопытки;
								
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗакрытьОкноПечатнойФормы = Истина;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСлужебнаяЗаписка(Команда)
	// Массив выделенных строк из списка СоставКоманд.
	ДанныеПечати = Элементы.Список.ВыделенныеСтроки;
	
	МассивФормированиеКоманд 	= Новый Массив; 
	МассивВключениеВКоманду 	= Новый Массив;
	МассивИсключениеИзКоманды 	= Новый Массив; 
	//Цикл по разделению документов
	Для каждого ОбъектПечати Из ДанныеПечати Цикл
	
		Если ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ФормированиеГруппы") Тогда
			МассивФормированиеКоманд.Добавить(ОбъектПечати); 	         
		ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ВключениеСпортсменовВГруппу") Тогда 			
			МассивВключениеВКоманду.Добавить(ОбъектПечати);
		ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ИсключениеСпортсменовИзГруппы") Тогда 			
			МассивИсключениеИзКоманды.Добавить(ОбъектПечати);	
		КонецЕсли; 
	
	КонецЦикла;  
	
	#Если Не ВебКлиент Тогда
		Если МассивФормированиеКоманд.Количество() <> 0 Тогда 
			ПечатьСлужебная("Документ.ФормированиеГруппы", "ПФ_DOC_Приказ", МассивФормированиеКоманд, "Приказ о формировании команды Word");
		КонецЕсли;
		
		Если МассивВключениеВКоманду.Количество() <> 0 Тогда
			ПечатьСлужебная("Документ.ВключениеСпортсменовВГруппу", "ПФ_DOC_СлужебнаяЗаписка", МассивВключениеВКоманду, "Служебная записка Word");
		КонецЕсли;
		
		Если МассивИсключениеИзКоманды.Количество() <> 0 Тогда
			ПечатьСлужебная("Документ.ИсключениеСпортсменовИзГруппы", "ПФ_DOC_СлужебнаяЗаписка", МассивИсключениеИзКоманды, "Служебная записка Word");
		КонецЕсли;
	#Иначе
		Если МассивФормированиеКоманд.Количество() <> 0 Тогда	
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ФормированиеГруппы",
			"ПФ_MXL_Приказ",
			МассивФормированиеКоманд,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
		
		Если МассивВключениеВКоманду.Количество() <> 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ВключениеСпортсменовВГруппу",
			"ПФ_MXL_СлужебнаяЗаписка",
			МассивВключениеВКоманду,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
		
		Если МассивИсключениеИзКоманды.Количество() <> 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ИсключениеСпортсменовИзГруппы",
			"ПФ_MXL_СлужебнаяЗаписка",
			МассивИсключениеИзКоманды,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСлужебная(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати, НаименованиеМакета)
	
	// Не работает здесь, пишет Метод Количество() не обнаружен.
	//Если ДанныеПечати.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;   
		
	МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати);
	
	ВывестиСлужебнуюЗаписку(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, НаименованиеМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСлужебнуюЗаписку(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, НаименованиеМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		
	Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	
	Для Каждого ОбъектДанных Из ДанныеПечати Цикл
		
		ДанныеОбъектаМассив     = МакетИДанныеОбъекта.Данные[ОбъектДанных][ИмяМакета];
		
		Для Каждого ДанныеОбъекта Из  ДанныеОбъектаМассив Цикл
			
			Попытка
			
				ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
				Если ПечатнаяФорма = Неопределено Тогда
					УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
					Возврат;                                                             
				КонецЕсли;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьШапка"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область,ДанныеОбъекта.ОбластьШапка, Ложь);
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьСписокСпортсмены"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.ОбластьСписокСпортсмены, Ложь);
			
				Для Каждого СтрокаШапкаТаблицы Из ДанныеОбъекта.ОбластьШапкаТаблицы Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьШапкаТаблицы"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаШапкаТаблицы, Ложь);
					Для каждого СтрокаСпортсмены Из СтрокаШапкаТаблицы.МассивСтрокСпортсмены Цикл
						Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьСтрокаТаблицыСпортсмены"]);
						УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаСпортсмены, Ложь);
					КонецЦикла; 			
				КонецЦикла;
												
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОбластьПодвал"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.ОбластьПодвал, Ложь);	
				
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗакрытьОкноПечатнойФормы = Истина;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	
КонецПроцедуры

// - Адильбеков А.Б. 02.06.2020 IN-6762 }

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ТекущийСпортсмен) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект);
		Если Параметр = Тип("ДокументСсылка.ВключениеСпортсменовВГруппу") Тогда
			ОткрытьФорму("Документ.ВключениеСпортсменовВГруппу.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
		ИначеЕсли Параметр = Тип("ДокументСсылка.ИсключениеИзСпортивногоУчреждения") Тогда
			ОткрытьФорму("Документ.ИсключениеИзСпортивногоУчреждения.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
		Иначе
			ОткрытьФорму("Документ.ФормированиеГруппы.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСпортсменуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спортсмен", ТекущийСпортсмен);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВключениеСпортсменовВГруппу.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ ВТ_Документы
	                |ИЗ
	                |	Документ.ВключениеСпортсменовВГруппу.Спортсмены КАК ВключениеСпортсменовВГруппу
	                |ГДЕ
	                |	ВключениеСпортсменовВГруппу.Спортсмен = &Спортсмен
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ИсключениеСпортсменовИзГруппы.Ссылка
	                |ИЗ
	                |	Документ.ИсключениеСпортсменовИзГруппы.Спортсмены КАК ИсключениеСпортсменовИзГруппы
	                |ГДЕ
	                |	ИсключениеСпортсменовИзГруппы.Спортсмен = &Спортсмен
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ФормированиеГруппы.Ссылка
	                |ИЗ
	                |	Документ.ФормированиеГруппы.Спортсмены КАК ФормированиеГруппы
	                |ГДЕ
	                |	ФормированиеГруппы.Спортсмен = &Спортсмен
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Документы.Ссылка КАК Ссылка
	                |ИЗ
	                |	ВТ_Документы КАК ВТ_Документы
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Документы.Ссылка";
	массивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", массивДокументов, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, ДопПараметры) Экспорт
	
	УстановитьОтборПоСпортсменуНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
